name: "ensemble"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "food_classifier"
      model_version: -1
      input_map {
        key: "INPUT_IMAGE"
        value: "INPUT_IMAGE"
      }
      output_map {
        key: "FOOD_LABEL"
        value: "FOOD_LABEL"
      }
    },
    {
      model_name: "conditional_captioning"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "INPUT_IMAGE"
      }
      input_map {
        key: "FOOD_LABEL"
        value: "FOOD_LABEL"
      }
      output_map {
        key: "OUTPUT"
        value: "OUTPUT"
      }
    }
  ]
}
